{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hello",
        "Good morning",
        "Good evening",
        "Hey there",
        "What's up"
      ],
      "responses": [
        "Hello! Welcome to our fashion platform. How can I help you today?",
        "Hi there! I'm here to assist you with your fashion needs.",
        "Welcome! How can I help you find the perfect outfit?"
      ]
    },
    {
      "tag": "product_inquiry",
      "patterns": [
        "Tell me about this product",
        "What sizes are available?",
        "Is this in stock?",
        "What colors do you have?",
        "Product details",
        "More information"
      ],
      "responses": [
        "I'd be happy to help with product information! Could you please specify which item you're interested in?",
        "Let me get you the details for that product. What specific information would you like?",
        "I can help you with sizes, colors, and availability. Which product are you asking about?"
      ]
    },
    {
      "tag": "recommendations",
      "patterns": [
        "What should I wear?",
        "Recommend something",
        "What's trending?",
        "Show me similar items",
        "What goes with this?",
        "Style suggestions"
      ],
      "responses": [
        "I'd love to give you personalized recommendations! What's the occasion or style you're looking for?",
        "Based on current trends, I can suggest some great options. What's your preferred style?",
        "Let me find some perfect matches for you! What type of clothing are you interested in?"
      ]
    },
    {
      "tag": "virtual_tryon",
      "patterns": [
        "Can I try this on?",
        "Virtual try on",
        "How will this look on me?",
        "Try before buy",
        "See how it fits"
      ],
      "responses": [
        "Yes! You can use our virtual try-on feature. Just upload your photo and see how the outfit looks on you!",
        "Our virtual try-on technology lets you see how clothes will look before you buy. Would you like to try it?",
        "You can virtually try on any item! Just click the 'Try On' button on the product page."
      ]
    },
    {
      "tag": "shipping",
      "patterns": [
        "How long is shipping?",
        "Delivery time",
        "When will my order arrive?",
        "Shipping cost",
        "Free shipping"
      ],
      "responses": [
        "We offer free shipping on orders over $50. Standard delivery takes 3-5 business days.",
        "Shipping typically takes 3-5 business days. Express shipping is available for faster delivery.",
        "Your order will arrive within 3-5 business days. Free shipping is available on qualifying orders."
      ]
    },
    {
      "tag": "returns",
      "patterns": [
        "Return policy",
        "Can I return this?",
        "How to return",
        "Refund",
        "Exchange"
      ],
      "responses": [
        "We have a 30-day return policy. Items must be unworn and in original condition.",
        "You can return or exchange items within 30 days of purchase. Would you like help starting a return?",
        "Returns are easy! You have 30 days to return unworn items for a full refund or exchange."
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Bye",
        "Goodbye",
        "See you later",
        "Thanks",
        "Thank you"
      ],
      "responses": [
        "Thank you for shopping with us! Have a great day!",
        "Goodbye! Don't hesitate to reach out if you need any help.",
        "Thanks for visiting! Happy shopping!"
      ]
    }
  ]
}
